In [13]:
#pip install pytesseract

In [14]:
# pip install opencv-python

In [15]:
# pip install pytz

In [16]:
# pip install lxml

In [17]:
# pip install pyqt5

In [1]:
import os

In [1]:
pip install PyQt5

Requirement already satisfied: PyQt5 in c:\users\steffin john\anaconda3\lib\site-packages (5.15.9)
Requirement already satisfied: PyQt5-Qt5>=5.15.2 in c:\users\steffin john\anaconda3\lib\site-packages (from PyQt5) (5.15.2)
Requirement already satisfied: PyQt5-sip<13,>=12.11 in c:\users\steffin john\anaconda3\lib\site-packages (from PyQt5) (12.11.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install sip

Requirement already satisfied: sip in c:\users\steffin john\anaconda3\lib\site-packages (4.19.13)
Note: you may need to restart the kernel to use updated packages.

In [20]:
import pandas as pd

In [18]:
from PIL import Image
import xml.etree.ElementTree as ET

In [6]:
import pytesseract
pytesseract.pytesseract.tesseract_cmd = r'C:\\Program Files\\Tesseract-OCR\\tesseract.exe'

In [7]:
import cv2

In [8]:
img_1 = cv2.imread(r'C:\\Users\\STEFFIN JOHN\\Desktop\\Jypiter Python\\Hackaton Competition\\Intellect AI Hackathon 2023\\inv_train\\2.jpeg')

In [9]:
cv2.imshow('sample img',img_1)
cv2.waitKey(0)
cv2.destroyAllWindows()

In [10]:
text = pytesseract.image_to_string(img_1)
print(text)

| smverce 2536 °
Cece May 31, 1986 (Mailed June 9)
5400/01A

«+ William A. Robinson, Inc.

Mr. William I. Campbell
Marketing Services Ag ip
“0 _ Executive Vice President, Marketing
35 East Wacker Drive PHILIP MORRIS U.S.A. .
Chicago, I 6602108 120 Park Avenue

9389 New York, NY 10017 ’

I. CONTINUING PROJECTS.

. Developed additional concepts for trade
class specific programs. $4,230.00
| Continued refinement of Parliament
. Regional Comedy program. | 1,975.00
| ‘presented initial concepts and developed | .
additional ‘ideas for direct marketing
- all brands. 4,471.00
|
| . Began discussions with Marketing Promotion |
on plussing Marlboro events. 800.00 e@

II. NEW PROJECTS . 1

. Developed premium priced cigarette concepts
| (for June presentation.) 4,350.00 | J {t
| | peveloped and presented B & H business in
| building concepts. 5,250.00 |
i

II. ALL BRANDS |

| . Began development of Seminar. )

| . Administration ) 13,877.00
. Account Service ) |

| .  Qut-of-pocket expenses 6,347.84

|
. |

$42,300.84

B1392

wad A PAYMENT TERMS Sas Guthonth ace charge on unpaid aed ra

In [25]:
image = Image.open(r'C:\\Users\\STEFFIN JOHN\\Desktop\\Jypiter Python\\Hackaton Competition\\Intellect AI Hackathon 2023\\inv_train\\2.jpeg')

In [53]:
tree = ET.parse(r'C:\\Users\\STEFFIN JOHN\\Desktop\\Jypiter Python\\Hackaton Competition\\Intellect AI Hackathon 2023\\inv_train\\2.xml')
root = tree.getroot()

In [77]:
df = pd.DataFrame(columns=['name', 'text'])

In [87]:
for obj in root.findall('object'):
    name = obj.find('name').text
    xmin = int(obj.find('bndbox/xmin').text)
    ymin = int(obj.find('bndbox/ymin').text)
    xmax = int(obj.find('bndbox/xmax').text)
    ymax = int(obj.find('bndbox/ymax').text)
    region = image.crop((xmin, ymin, xmax, ymax))
    text = pytesseract.image_to_string(region)
    df = df.append({'name': name, 'text': text}, ignore_index=True)

C:\Users\STEFFIN JOHN\AppData\Local\Temp\ipykernel_11376\3608626359.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': name, 'text': text}, ignore_index=True)
C:\Users\STEFFIN JOHN\AppData\Local\Temp\ipykernel_11376\3608626359.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': name, 'text': text}, ignore_index=True)
C:\Users\STEFFIN JOHN\AppData\Local\Temp\ipykernel_11376\3608626359.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': name, 'text': text}, ignore_index=True)
C:\Users\STEFFIN JOHN\AppData\Local\Temp\ipykernel_11376\3608626359.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': name, 'text': text}, ignore_index=True)
C:\Users\STEFFIN JOHN\AppData\Local\Temp\ipykernel_11376\3608626359.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': name, 'text': text}, ignore_index=True)
C:\Users\STEFFIN JOHN\AppData\Local\Temp\ipykernel_11376\3608626359.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': name, 'text': text}, ignore_index=True)

In [81]:
df

               name                                               text
0      Bill_To_Name                          Mr. William I. Campbell\n
1   Bill_To_Address  PHILIP MORRIS U.S.A.\n120 Park Avenue\nNow vor...
2    Invoice_Number                                             2536\n
3      Invoice_Date                                     May 31, 1986\n
4  Total_Tax_Amount                                        41,300.84\n
5      Total_Amount                                       41.300. 84\n

In [83]:
df = df.pivot(index=None, columns='name', values='text')

In [84]:
df

name,Bill_To_Address,Bill_To_Name,Invoice_Date,Invoice_Number,Total_Amount,Total_Tax_Amount
0,NaN,Mr. William I. Campbell\n,NaN,NaN,NaN,NaN
1,PHILIP MORRIS U.S.A.\n120 Park Avenue\nNow vor...,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,2536\n,NaN,NaN
3,NaN,NaN,"May 31, 1986\n",NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,"41,300.84\n"
5,NaN,NaN,NaN,NaN,41.300. 84\n,NaN

In [92]:
df_1 = pd.DataFrame(columns=['name', 'text'])

In [93]:
data = []
for obj in root.findall('object'):
    name = obj.find('name').text
    xmin = int(obj.find('bndbox/xmin').text)
    ymin = int(obj.find('bndbox/ymin').text)
    xmax = int(obj.find('bndbox/xmax').text)
    ymax = int(obj.find('bndbox/ymax').text)
    region = image.crop((xmin, ymin, xmax, ymax))
    text = pytesseract.image_to_string(region)
    data.append({'name': name, 'text': text})

In [94]:
df_1 = pd.concat([df_1, pd.DataFrame(data)])
# Transpose the dataframe
# df_1 = df_1.pivot(index=None, columns='name', values='text')

In [95]:
df_1

               name                                               text
0      Bill_To_Name                          Mr. William I. Campbell\n
1   Bill_To_Address  PHILIP MORRIS U.S.A.\n120 Park Avenue\nNow vor...
2    Invoice_Number                                             2536\n
3      Invoice_Date                                     May 31, 1986\n
4  Total_Tax_Amount                                        41,300.84\n
5      Total_Amount                                       41.300. 84\n

In [96]:
df_1 = df_1.pivot(index=None, columns='name', values='text')

In [97]:
df_1

name,Bill_To_Address,Bill_To_Name,Invoice_Date,Invoice_Number,Total_Amount,Total_Tax_Amount
0,NaN,Mr. William I. Campbell\n,NaN,NaN,NaN,NaN
1,PHILIP MORRIS U.S.A.\n120 Park Avenue\nNow vor...,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,2536\n,NaN,NaN
3,NaN,NaN,"May 31, 1986\n",NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,"41,300.84\n"
5,NaN,NaN,NaN,NaN,41.300. 84\n,NaN

In [98]:
# Create an empty dictionary to store the results
results = {}

# Loop through the annotations and extract the text from each region
for obj in root.findall('object'):
    name = obj.find('name').text
    xmin = int(obj.find('bndbox/xmin').text)
    ymin = int(obj.find('bndbox/ymin').text)
    xmax = int(obj.find('bndbox/xmax').text)
    ymax = int(obj.find('bndbox/ymax').text)
    region = image.crop((xmin, ymin, xmax, ymax))
    text = pytesseract.image_to_string(region)
    results[name] = text

In [99]:
# Create a DataFrame with a single row using the results dictionary
df = pd.DataFrame.from_records([results])

In [100]:
df

,Bill_To_Name,Bill_To_Address,Invoice_Number,Invoice_Date,Total_Tax_Amount,Total_Amount
0,Mr. William I. Campbell\n,PHILIP MORRIS U.S.A.\n120 Park Avenue\nNow vor...,2536\n,"May 31, 1986\n","41,300.84\n",41.300. 84\n

In [ ]:
import pytesseract
from PIL import Image
import xml.etree.ElementTree as ET
import pandas as pd
import os

# Set the path to the directory containing the images and annotations
path = 'path/to/directory'

# Create an empty list to store the results
results = []

# Loop through all the images in the directory
for filename in os.listdir(path):
    if filename.endswith('.jpg'):
        # Load the XML file with the annotations for this image
        tree = ET.parse(os.path.join(path, filename[:-4] + '.xml'))
        root = tree.getroot()

        # Load the image
        image = Image.open(os.path.join(path, filename))

        # Create a dictionary to store the results for this image
        image_results = {'filename': filename}

        # Loop through the annotations and extract the text from each region
        for obj in root.findall('object'):
            name = obj.find('name').text
            xmin = int(obj.find('bndbox/xmin').text)
            ymin = int(obj.find('bndbox/ymin').text)
            xmax = int(obj.find('bndbox/xmax').text)
            ymax = int(obj.find('bndbox/ymax').text)
            region = image.crop((xmin, ymin, xmax, ymax))
            text = pytesseract.image_to_string(region)
            image_results[name] = text

        # Append the results for this image to the list
        results.append(image_results)

# Create a DataFrame from the list of results
df = pd.DataFrame(results)